javascript_jquery/wheres_waldo/app/controllers/puzzles_controller.rb

  def index
    @puzzles = Puzzle.all
---
SELECT "puzzles".* FROM "puzzles"

  def show
    @puzzle = Puzzle.find(params[:id])
    @scores = @puzzle.scores.order(number: :desc).limit(20)
---
SELECT  "puzzles".* FROM "puzzles" WHERE "puzzles"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT  "scores".* FROM "scores" WHERE "scores"."puzzle_id" = $1 ORDER BY "scores"."number" DESC LIMIT $2  [["puzzle_id", 1], ["LIMIT", 20]]